#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# %% Главная БД, + начальные значения
# ! внимательно задать типы !
# Зарезервированы имена: Manager (менеджер БД), name (имя задачи)
# нельзя чтобы имена переменных совпали с методами задач (в текущей версии менеждер перезапишет имена)
# Имена начинаются с большой буквы. Могут иметь префикс:
# префикс m-model с бортовой модели, s-sensor с датчика, o-observed наблюдаемая
# без префикса - "истинная"
from pathlib import Path

import numpy as np
from pyquaternion import Quaternion

# Путь к папке, где лежит текущий файл
current_dir = Path(__file__).resolve().parent

OUTPUT_DIR = current_dir / "output"


class DataBase:
    # --- общие переменные ---
    t = 0.0  # время
    dt = 1  # шаг задач
    tmax = 500.0  # время моделирования
    cmd = 0  # команда всем задачам

    # --- пользовательские переменные ---
    x = 0


# задачи вызываются в порядке следования в словаре
Tasks = {
    "Ex": {
        "Keys": "t",
        "Addr": ("127.0.0.1", 6502),
    },
    "Ex1": {
        "Keys": "t,cmd,x",
        "Addr": ("127.0.0.1", 6501),
    },
}
